[
  {
    "name": "Tom Rossi",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Co-founder of Higher Pixels",
    "details": "Tom Rossi is the co-founder of Higher Pixels, a bootstrapped SaaS company based in Jacksonville, Florida. Since 2001, Tom has led the development of several successful web-based products, including Tick, Donor Tools, StreamCare, and Buzzsprout—one of the largest premium podcast hosting platform in the world. A longtime Ruby on Rails enthusiast, Tom brings a passion for elegant code and purposeful product design. When he’s not writing software or growing a team, he enjoys spending time with his wife and four kids, volunteering at his church, and serving on the boards of local ministries.",
    "image": "https://lh3.googleusercontent.com/d/1QCiaXhgN9EaSyPjvyzdz9qGb6IrWUb20=w1000?authuser=1/view",
    "talk_title": "Are you my mother",
    "talk_description": "Inheritance in Rails can feel like a complex maze. This talk breaks down how we share behaviors and attributes through a series of vivid animations and illustrations that make abstract programming concepts tangible and intuitive. We’ll explore when and how to use different inheritance strategies, drawing from real-world experiences to understand and guide design decisions.",
    "twitter": "https://x.com/TomRossi7",
    "linkedin": "https://www.linkedin.com/in/tomrossi7/",
    "website": "https://www.higherpixels.com/",
    "url": "rossi",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Tresor Bireke",
    "is_keynote": "No",
    "gender": "male",
    "bio": "SWE Thoughtbot",
    "details": "Trésor Bireke Muhigirwa is a software developer based in Dubai. His journey into programming began with a curiosity for problem-solving and a commitment to continuous learning. After completing a full-stack development program at Microverse, he has worked with various teams, contributing to web applications using Ruby on Rails, JavaScript, and cloud-based technologies. Currently, Trésor is a developer at thoughtbot, where he focuses on building maintainable and scalable software solutions. He enjoys collaborating with others, contributing to open-source projects, and sharing knowledge through community events and writing.",
    "image": "https://lh3.googleusercontent.com/d/1aaaX4vlW0ZGLtMuGZjJIgQlNazetoNV_=w1000?authuser=1/view",
    "talk_title": "Move fast but don’t break things: How to balance delivery speed and reliability",
    "talk_description": "In fast-paced environments, speed often comes at the cost of reliability. But as products scale, stability becomes just as critical. This talk shares practical strategies for delivering quickly without breaking things — from feature flags and safe deployment patterns to testing and monitoring. We’ll explore how to manage complexity, reduce risk, and build confidence when shipping to production. Ideal for developers working on large systems who want to move fast—safely.",
    "twitter": "https://x.com/TBireke",
    "linkedin": "https://www.linkedin.com/in/tresor-bireke/",
    "website": "https://tresor.netlify.app/",
    "url": "tresor",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Purity Maina",
    "is_keynote": "No",
    "gender": "female",
    "bio": "Technology | Robotic Process Automation | SAFe Practitioner | DevOps | Agile Leadership",
    "details": "Purity Maina is a seasoned tech professional with nine years of experience shaping the African tech landscape through innovative solutions. She empowers organizations and individuals by developing impactful products, as evidenced by her significant contributions to projects with the World Bank (CGAP), Kenya Films Board, Safaricom, and LipaLater. As an Engineering Manager specializing in Enterprise and Robotic Process Automation (RPA), Purity is deeply passionate about harnessing technology to drive sustainable growth.",
    "image": "https://lh3.googleusercontent.com/d/1wnblAINI_AT-yDS51u3TM-MndMNJQt-N=w1000?authuser=1/view",
    "talk_title": "Your First RPA Bot",
    "talk_description": "RPA is an emerging technology that is rewriting the story of work, freeing up human resources to prioritise more complex tasks. How does your day-to-day work schedule look? Do you have mundane tasks to tick off your to-do list before diving into deep work? RPA to the rescue!",
    "twitter": "",
    "linkedin": "http://twitter.com/bantu_bytes",
    "website": "https://www.linkedin.com/in/puritymaina",
    "url": "purity",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Caleb Muoki",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Senior Platform Engineer",
    "details": "Muoki Caleb is a Senior Platform Engineer with over six years of experience in the tech industry. A technologist at heart, Muoki thrives at the intersection of infrastructure, developer tooling, and automation—building resilient systems that empower teams and scale with confidence. His professional journey spans cloud computing, CI/CD, cybersecurity, and infrastructure as code, reflecting a passion for engineering excellence across disciplines. Outside the 9-to-5, Muoki is just as hands-on—whether it’s trying to defy physics in 20-year-old project cars or cultivating mindfulness through Vipassana meditation. Always learning, always building, Muoki brings curiosity and intentionality to every facet of his life.",
    "image": "https://lh3.googleusercontent.com/d/1aENrL6pqyxuTVl5-FkOy1GopjtuyYqYx=w1000?authuser=1/view",
    "talk_title": "DevOps is Dead, Long Live Platform Engineering",
    "talk_description": "DevOps began with a promise—faster delivery, better collaboration, empowered teams. But over time, it became a catch-all job title weighed down by toil. This talk explores the rise of Platform Engineering as a true evolution: applying product thinking to infrastructure and internal tooling. We’ll explore how platform engineering enables scale, removes friction, and brings developer experience (DX) to the forefront—aligning engineering efforts with business outcomes.",
    "twitter": "",
    "linkedin": "https://www.linkedin.com/in/muokicaleb",
    "website": "https://muokicaleb.com/",
    "url": "caleb",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Obie Fernandez",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Ruby Evangelist, Author, Principal Engineer at Shopify",
    "details": "The one and only Obie Fernandez, well-known Ruby evangelist since 2005, author of The Rails Way series and Patterns of Application Development Using AI, and Principal Engineer at Shopify.",
    "image": "https://lh3.googleusercontent.com/d/1-TBh-uJfSIZMnxavFRFM1Aka_cmpeDCN=w1000?authuser=1/view",
    "talk_title": "Patterns of Application Development Using AI Revisited",
    "talk_description": "In 2024, I authored the groundbreaking book “Patterns of Application Development Using AI,” which has been presented at numerous Ruby conferences worldwide. The insights and practical patterns from the book played a pivotal role in my securing the dream job of Principal Engineer, Augmented Engineering at Shopify. This talk serves as an update on how I am leveraging these AI patterns in real-life scenarios at scale.",
    "twitter": "https://x.com/obie",
    "linkedin": "https://www.linkedin.com/in/obiefernandez/",
    "website": "https://obiefernandez.com",
    "url": "obie",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Amani Kanu",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Tech Evangelist and Mentor ",
    "details": "Amani Kanu is a Tech Evangelist, Senior Frontend Engineer at Must Company, and Mentor with over 7 years of experience shaping the careers of developers across Africa. As the founder of FootPrint, a mentorship-driven platform aimed at accelerating job placement for tech professionals, Amani has empowered thousands of job seekers through personalized guidance and coaching. He is also the founder of the Calabar Tech Community and the Decadev Alumni Network, communities that collectively boast over 3,000 members. Amani’s mission is to help tech professionals not only learn but also navigate the complexities of career growth, balancing technical skills with real-world business needs. He mentors for Semicolon Africa, Decagon, Nexascale and AltSchool, and regularly speaks at tech events to share his knowledge and inspire the next generation of developers.",
    "image": "https://lh3.googleusercontent.com/d/1hfyyv3nFHj9WJY8UxSMJAFESifQlSvZ-=w1000?authuser=1/view",
    "talk_title": "Mentorship – Tool for the Future",
    "talk_description": "Mentorship is a game-changer in every Ruby developer’s journey. In this talk, discover how intentional mentorship can shape your future as a Ruby developer, helping you grow faster, build better.",
    "twitter": "https://x.com/AmaniKanu",
    "linkedin": "https://www.linkedin.com/in/amani-kanu/",
    "website": "",
    "url": "amani",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Marek Piasecki",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Full Stack Web Developer",
    "details": "I started programming when I was 8 years old which was 30 years ago.  I have unusually broad development and computer science experience and a really successful career.",
    "image": "https://lh3.googleusercontent.com/d/1mtWRKEjzMAKHfTFK-Fpo9ttpBGiBrf7F=w1000?authuser=1/view",
    "talk_title": "Yet another framework workshops",
    "talk_description": "I had a chance to present yet another framework - Pro - on the opening of Ruby Conf Africa 2024. Let’s dive deeper this year and get hands on it on workshops where you will receive early access and will be able to ask any question.",
    "twitter": "https://x.com/mad_maniak",
    "linkedin": "https://www.linkedin.com/in/marekpiasecki/",
    "website": "https://mad.maniak.pro",
    "url": "marek",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Ganesh Kunwar",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Co-founder and Director of Project Delivery at Gurzu",
    "details": "Ganesh Kunwar is a seasoned software professional with over 12 years of hands-on experience building scalable web applications with Ruby on Rails. As the Co-founder and Director of Project Delivery at Gurzu Inc., he has led multiple Ruby on Rails teams and successfully delivered a wide range of products for startups and enterprises around the world. Ganesh has architected and shipped numerous Rails applications, driving both technical direction and team performance. A dedicated open-source contributor, he is also the maintainer of #BuiltWithRuby, a community initiative showcasing real-world projects built using Ruby.\n\nBeyond code, Ganesh is an advocate for clean, maintainable software, strong engineering culture, and agile delivery. He actively shares his knowledge through community events, and as member of Ruby Nepal and Agile Nepal community events, he helps bridge the gap between leadership and technology in software teams.",
    "image": "https://lh3.googleusercontent.com/d/1NEbbsLFwSeZkPsGWGwh1x0krQnEhWg4W=w1000?authuser=1/view",
    "talk_title": "Optimizing for Efficiency: How Rails Helps Eliminate Development Waste",
    "talk_description": "Software development is often slowed down by hidden waste; things like tech debt, team dependencies and poor communication. Here, in this talk, I will explore how to spot these inefficiencies and Rails framework helps to eliminate those waste and boost efficiency of development team.",
    "twitter": "https://x.com/gkunwar1",
    "linkedin": "",
    "website": "https://ganesh.codes",
    "url": "ganesh",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Patrick Wendo ",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Ruby on Rails Developer | Data Scientist | Quantum Computing Enthusiast",
    "details": "Patrick is a Ruby on Rails developer with a degree in Computer Science from Jomo Kenyatta University of Agriculture and Technology. He holds a Master’s degree and has expertise in scalable data management systems and cloud technologies. Currently, Patrick is furthering his knowledge in data and information management at the Vrije Universiteit Brussel (VUB) in Brussels.",
    "image": "https://lh3.googleusercontent.com/d/1nebxa_g3WQH0z5ulmCDvJnU0pNKCT7Hv=w1000?authuser=1/view",
    "talk_title": "Read the tests, best way to get up to speed with a new codebase.",
    "talk_description": "We discuss why new developers should read the tests, and how veteran developers should write tests for someone who has never seen the codebase before.",
    "twitter": "",
    "linkedin": "https://www.linkedin.com/in/patrick-wendo-bb0547171/",
    "website": "https://github.com/W3NDO",
    "url": "wendo",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Dmitry Pogrebnoy",
    "is_keynote": "No",
    "gender": "male",
    "bio": "SWE and Team Lead at RubyMine, JetBrains",
    "details": "As a seasoned software engineer and RubyMine Team Leader, I have spent countless hours mastering the intricacies of the Ruby development tools. My deep dive into debugging internals has not only honed my expertise but has also allowed me to contribute to the Ruby and Rails community.",
    "image": "https://lh3.googleusercontent.com/d/1Kr5y_U3-oMB4V_By8O7KrWWFg95O0AQ7=w1000?authuser=1/view",
    "talk_title": "Demystifying Ruby Debuggers: A Deep Dive into Internals",
    "talk_description": "Know the tool you are using! Maximize your debugger knowledge with our in-depth talk! Gain vital insights of Byebug, debug gem and RubyMine Debugger. Uncover the secrets of Ruby debugger internals. This talk will equip you with an advanced understanding of how ruby debuggers work and provide you with useful insights of how tools like RubyMine Debugger can speed up your debugging process.",
    "twitter": "",
    "linkedin": "https://www.linkedin.com/in/dmitrypogrebnoy",
    "website": "",
    "url": "dmitry",
    "session_day": null,
    "session_time": null
  },
  {
    "name": "Njonge Fred",
    "is_keynote": "No",
    "gender": "male",
    "bio": "Ruby and Rails Developer",
    "details": "Fred is a backend-focused software developer and tech enthusiast based in Nairobi, Kenya, with a deep love for Ruby and the elegance it brings to building software. He builds scalable, practical solutions for small businesses, startups, and communities —using Ruby on Rails.\n\nFred’s work spans shop management systems, financial tools, blogging platforms, and decentralized fundraising applications on Hedera, all developed with a clear purpose: to solve real-world problems while keeping technology simple and intuitive. He’s also an advocate for developer growth, sharing his journey and helping others get into tech through open learning and community engagement.\n\nHis vision is grounded in people-first development: writing software that’s clean, human-friendly, and meaningful. Fred believes Ruby still has a bright future—especially in Africa—and is excited to share how the language can evolve and thrive alongside newer technologies",
    "image": "https://lh3.googleusercontent.com/d/1pYymLkHsn7K_Z9bedpWHU8-9qWoKybR9=w1000?authuser=1/view",
    "talk_title": "Beyond Code: The Future of Ruby in a Changing Tech Landscape",
    "talk_description": "Ruby has always been a language of creativity and innovation. But as the tech world evolves, how does Ruby stay relevant? In this talk, we’ll dive into the exciting future of Ruby and how it’s adapting to cutting-edge technologies like AI, machine learning, cloud-native development, and the Internet of Things (IoT).\n\nWe’ll explore how Ruby can evolve to meet the demands of the future, ensuring it remains the go-to language for developers building the next generation of software. From boosting performance to embracing new paradigms, we’ll show you how Ruby continues to drive innovation, whether you’re building scalable applications or working with the latest tech stacks.\n\nJoin us as we envision Ruby’s role beyond the traditional web and discover how it’s positioned to lead in the rapidly changing world of technology. This talk isn’t just about Ruby – it’s about the future of coding itself, and why Ruby is a key part of shaping that future. Don’t miss the chance to be part of this exciting journey into the future of Ruby!",
    "twitter": "https://x.com/njongefred",
    "linkedin": null,
    "website": null,
    "url": null,
    "session_day": null,
    "session_time": null
  }
]